RIOT-OS/RIOT/drivers/kw41zrf/kw41zrf_xcvr.c
    /* Set default DCOC DAC INIT Value */
    XCVR_RX_DIG->DCOC_DAC_INIT =
        XCVR_RX_DIG_DCOC_DAC_INIT_BBA_DCOC_INIT_I(bbf_dacinit_i) |
        XCVR_RX_DIG_DCOC_DAC_INIT_BBA_DCOC_INIT_Q(bbf_dacinit_q) |
        XCVR_RX_DIG_DCOC_DAC_INIT_TZA_DCOC_INIT_I(tza_dacinit_i) |
        XCVR_RX_DIG_DCOC_DAC_INIT_TZA_DCOC_INIT_Q(tza_dacinit_q);
    /* Store DCOC_DAC_INIT value */
    uint32_t dcoc_init_reg_value_dcgain = XCVR_RX_DIG->DCOC_DAC_INIT;

    kw41zrf_xcvr_spin(TsettleCal * 2);

    uint32_t meas_sum = 0;
    /* SWEEP I/Q CHANNEL */
    /* BBF NEG STEP */
    XCVR_RX_DIG->DCOC_DAC_INIT = XCVR_RX_DIG_DCOC_DAC_INIT_BBA_DCOC_INIT_I(bbf_dacinit_i - DCOC_DAC_BBF_STEP) |
                                 XCVR_RX_DIG_DCOC_DAC_INIT_BBA_DCOC_INIT_Q(bbf_dacinit_q - DCOC_DAC_BBF_STEP) |
                                 XCVR_RX_DIG_DCOC_DAC_INIT_TZA_DCOC_INIT_I(tza_dacinit_i) |
                                 XCVR_RX_DIG_DCOC_DAC_INIT_TZA_DCOC_INIT_Q(tza_dacinit_q);
    kw41zrf_xcvr_spin(TsettleCal * 4);

    int32_t dc_meas_im = 0;
    int32_t dc_meas_qm = 0;
    rx_dc_est_samples(&dc_meas_im, &dc_meas_qm, RX_DC_EST_SAMPLES);

    /* BBF POS STEP */
    XCVR_RX_DIG->DCOC_DAC_INIT = XCVR_RX_DIG_DCOC_DAC_INIT_BBA_DCOC_INIT_I(bbf_dacinit_i + DCOC_DAC_BBF_STEP) |
                                 XCVR_RX_DIG_DCOC_DAC_INIT_BBA_DCOC_INIT_Q(bbf_dacinit_q + DCOC_DAC_BBF_STEP) |
                                 XCVR_RX_DIG_DCOC_DAC_INIT_TZA_DCOC_INIT_I(tza_dacinit_i) |
                                 XCVR_RX_DIG_DCOC_DAC_INIT_TZA_DCOC_INIT_Q(tza_dacinit_q);
    kw41zrf_xcvr_spin(TsettleCal * 4);
    int32_t dc_meas_ip = 0;
    int32_t dc_meas_qp = 0;
    rx_dc_est_samples(&dc_meas_ip, &dc_meas_qp, RX_DC_EST_SAMPLES);
    DEBUG("dc_meas_i- = %" PRId32 "\n", dc_meas_im);
    DEBUG("dc_meas_q- = %" PRId32 "\n", dc_meas_qm);
    DEBUG("dc_meas_i+ = %" PRId32 "\n", dc_meas_ip);
    DEBUG("dc_meas_q+ = %" PRId32 "\n", dc_meas_qp);
    meas_sum += dc_meas_ip - dc_meas_im;
    DEBUG("meas_sum = %" PRIu32 "\n", meas_sum);
    meas_sum += dc_meas_qp - dc_meas_qm;
    DEBUG("meas_sum = %" PRIu32 "\n", meas_sum);
    meas_sum /= 2 * DCOC_DAC_BBF_STEP;
    DEBUG("meas_sum = %" PRIu32 "\n", meas_sum);

    XCVR_RX_DIG->DCOC_DAC_INIT = dcoc_init_reg_value_dcgain; /* Return DAC setting to initial */

    /* Compute the average sampled gain for the measured steps */

    /* Calculate BBF DCOC STEPS, RECIPROCALS */
    /* meas_sum here is the average gain multiplied by (4 * RX_DC_EST_SAMPLES) */
    /* Compute the gain average as a Q6.3 number */
    /* rounded result, Q6.3 number */
    uint16_t bbf_dcoc_gain_measured = calc_div_rounded(meas_sum, (RX_DC_EST_TOTAL_SAMPLES / (1u << 3)));

    DEBUG("temp_step = %f\n", (float)meas_sum / RX_DC_EST_TOTAL_SAMPLES);
    DEBUG("bbf_dcoc_gain_measured = %u\n", (unsigned)bbf_dcoc_gain_measured);

    /* Check the measured value for validity. Should be in the range:
     * 250 < bbf_dcoc_gain_measured < 305, according to NXP wireless framework v5.4.3 (MCUXpresso KW36 SDK)
     */
    if ((250 < bbf_dcoc_gain_measured) & (bbf_dcoc_gain_measured < 305))
    {
        /* Compute reciprocal, as Q15 number, but only the 13 lowest bits are programmable */
        /* rounded result, ((2**15) / slope) */
        uint32_t bbf_dcoc_gain_measured_rcp = calc_div_rounded((1u << 15) * RX_DC_EST_TOTAL_SAMPLES, meas_sum);
        DEBUG("bbf_dcoc_gain_measured_rcp = %"PRIu32"\n", bbf_dcoc_gain_measured_rcp);

        uint32_t bbf_dcoc_gain_default =
            (xcvr_common_config.dcoc_bba_step_init &
                XCVR_RX_DIG_DCOC_BBA_STEP_BBA_DCOC_STEP_MASK) >>
            XCVR_RX_DIG_DCOC_BBA_STEP_BBA_DCOC_STEP_SHIFT;
        /* Rescale all default TZA DCOC gains according to the measured BBF gain,
         * using (bbf_dcoc_gain_measured / bbf_dcoc_gain_default) as the implicit
         * scale factor, but rewrite it to use
         * (meas_sum / (bbf_dcoc_gain_default * RX_DC_EST_TOTAL_SAMPLES / (1u << 3))))
         * for better numeric precision */
        /* rounded result, Q9.3 number */
        bbf_dcoc_gain_default *= (RX_DC_EST_TOTAL_SAMPLES / (1u << 3));
        DEBUG("base gain = %u\n", (unsigned)bbf_dcoc_gain_default);
        /* Make the trims active */
        XCVR_RX_DIG->DCOC_BBA_STEP =
            XCVR_RX_DIG_DCOC_BBA_STEP_BBA_DCOC_STEP(bbf_dcoc_gain_measured) |
            XCVR_RX_DIG_DCOC_BBA_STEP_BBA_DCOC_STEP_RECIP(bbf_dcoc_gain_measured_rcp);
        const uint32_t *dcoc_tza_step_config_ptr = &xcvr_common_config.dcoc_tza_step_00_init;
        /* All tza_step_* configuration registers use sequential memory addresses */
        volatile uint32_t *xcvr_rx_dig_dcoc_tza_step_ptr = &XCVR_RX_DIG->DCOC_TZA_STEP_0;
        for (unsigned k = 0; k <= 10; ++k)
        {
            /* Calculate TZA DCOC STEPSIZE & its RECIPROCAL */
            uint16_t tza_gain_default =
                (dcoc_tza_step_config_ptr[k] &
                    XCVR_RX_DIG_DCOC_TZA_STEP_0_DCOC_TZA_STEP_GAIN_0_MASK) >>
                XCVR_RX_DIG_DCOC_TZA_STEP_0_DCOC_TZA_STEP_GAIN_0_SHIFT;
            /* Using meas_sum for higher precision */
            DEBUG("tza_gain_default[%u] = %u\n", k, (unsigned)tza_gain_default);
            uint32_t dcoc_step = calc_div_rounded(tza_gain_default * meas_sum, bbf_dcoc_gain_default);
            uint32_t dcoc_step_rcp = calc_div_rounded((0x8000ul << 3) * bbf_dcoc_gain_default, tza_gain_default * meas_sum);
            DEBUG("tza_dcoc_step[%u].dcoc_step = %u\n", k, (unsigned)dcoc_step);
            DEBUG("tza_dcoc_step[%u].dcoc_step_rcp = %u\n", k, (unsigned)dcoc_step_rcp);
            xcvr_rx_dig_dcoc_tza_step_ptr[k] =
                XCVR_RX_DIG_DCOC_TZA_STEP_0_DCOC_TZA_STEP_GAIN_0(dcoc_step) |
                XCVR_RX_DIG_DCOC_TZA_STEP_0_DCOC_TZA_STEP_RCP_0(dcoc_step_rcp) ;
        }
    }
    else
    {
        LOG_ERROR("!!! XCVR trim failed: bbf_dcoc_step = %u!\n", (unsigned)bbf_dcoc_gain_measured);
        status = -EAGAIN; /* Failure */
    }

    /* Restore Registers */
    XCVR_RX_DIG->DCOC_CTRL_0 = dcoc_ctrl_0_stack; /* Restore DCOC_CTRL_0 state to prior settings */
    XCVR_RX_DIG->DCOC_CTRL_1 = dcoc_ctrl_1_stack; /* Restore DCOC_CTRL_1 state to prior settings */
    XCVR_RX_DIG->RX_DIG_CTRL = rx_dig_ctrl_stack; /* Restore RX_DIG_CTRL state to prior settings */
    XCVR_RX_DIG->DCOC_CAL_GAIN = dcoc_cal_gain_state; /* Restore DCOC_CAL_GAIN state to prior setting */
    XCVR_RX_DIG->AGC_CTRL_1 = agc_ctrl_1_stack; /* Save state of RX_DIG_CTRL for later restore */

