RIOT-OS/RIOT/drivers/kw41zrf/kw41zrf_xcvr.c
    return status;
}

static void kw41zrf_dcoc_dac_init_cal(void)
{
    uint8_t p_tza_dac_i = 0, p_tza_dac_q = 0;
    uint8_t p_bba_dac_i = 0, p_bba_dac_q = 0;
    uint8_t i = 0;
    uint8_t bba_gain = 11;
    uint8_t TZA_I_OK = 0, TZA_Q_OK = 0, BBA_I_OK = 0, BBA_Q_OK = 0;

    uint32_t temp;

    /* Save registers */
    uint32_t dcoc_ctrl_0_stack = XCVR_RX_DIG->DCOC_CTRL_0; /* Save state of DCOC_CTRL_0 for later restore */
    uint32_t dcoc_ctrl_1_stack = XCVR_RX_DIG->DCOC_CTRL_1; /* Save state of DCOC_CTRL_1 for later restore */
    uint32_t rx_dig_ctrl_stack =  XCVR_RX_DIG->RX_DIG_CTRL; /* Save state of RX_DIG_CTRL for later restore */
    uint32_t agc_ctrl_1_stack = XCVR_RX_DIG->AGC_CTRL_1; /* Save state of RX_DIG_CTRL for later restore */
    uint32_t dcoc_cal_gain_state = XCVR_RX_DIG->DCOC_CAL_GAIN; /* Save state of DCOC_CAL_GAIN for later restore */

    /* Register config */
    /* Ensure AGC, DCOC and RX_DIG_CTRL is in correct mode */
    temp = XCVR_RX_DIG->RX_DIG_CTRL;
    temp &= ~XCVR_RX_DIG_RX_DIG_CTRL_RX_AGC_EN_MASK; /* Turn OFF AGC */
    temp &= ~XCVR_RX_DIG_RX_DIG_CTRL_RX_DCOC_CAL_EN_MASK; /* Disable for SW control of DCOC */
    temp &= ~XCVR_RX_DIG_RX_DIG_CTRL_RX_DC_RESID_EN_MASK; /* Disable for SW control of DCOC */
    XCVR_RX_DIG->RX_DIG_CTRL = temp;

    XCVR_RX_DIG->AGC_CTRL_1 = XCVR_RX_DIG_AGC_CTRL_1_USER_LNA_GAIN_EN(1) | /* Enable LNA Manual Gain */
                              XCVR_RX_DIG_AGC_CTRL_1_USER_BBA_GAIN_EN(1) | /* Enable BBA Manual Gain */
                              XCVR_RX_DIG_AGC_CTRL_1_LNA_USER_GAIN(0x0) | /* Set LNA Manual Gain */
                              XCVR_RX_DIG_AGC_CTRL_1_BBA_USER_GAIN(0x0); /* Set BBA Manual Gain */

    /* DCOC_CTRL_0 @ 4005_C02C -- Define default DCOC DAC settings in manual mode */
    temp = XCVR_RX_DIG->DCOC_CTRL_0;
    temp |= XCVR_RX_DIG_DCOC_CTRL_0_DCOC_MAN(1); /* Enable  Manual DCOC */
    temp |= XCVR_RX_DIG_DCOC_CTRL_0_DCOC_CORRECT_SRC(1); /* Ensure DCOC Tracking is enabled */
    temp |= XCVR_RX_DIG_DCOC_CTRL_0_DCOC_TRK_EST_OVR(1); /* Enable DC Estimator */
    temp |= XCVR_RX_DIG_DCOC_CTRL_0_DCOC_CORRECT_EN(1); /* Ensure DC correction is enabled */
    XCVR_RX_DIG->DCOC_CTRL_0 = temp;

    kw41zrf_xcvr_spin(TsettleCal);

    /* Set default DCOC DAC INIT Value */
    /* LNA and BBA DAC Sweep */
    uint8_t curr_bba_dac_i = 0x20;
    uint8_t curr_bba_dac_q = 0x20;
    uint8_t curr_tza_dac_i = 0x80;
    uint8_t curr_tza_dac_q = 0x80;

    /* Perform a first DC measurement to ensure that measurement is not clipping */
    XCVR_RX_DIG->DCOC_DAC_INIT = XCVR_RX_DIG_DCOC_DAC_INIT_BBA_DCOC_INIT_I(curr_bba_dac_i) |
                                 XCVR_RX_DIG_DCOC_DAC_INIT_BBA_DCOC_INIT_Q(curr_bba_dac_q) |
                                 XCVR_RX_DIG_DCOC_DAC_INIT_TZA_DCOC_INIT_I(curr_tza_dac_i) |
                                 XCVR_RX_DIG_DCOC_DAC_INIT_TZA_DCOC_INIT_Q(curr_tza_dac_q);

    int32_t dc_meas_i = 2000, dc_meas_i_p = 2000;
    int32_t dc_meas_q = 2000, dc_meas_q_p = 2000;
    do {
        bba_gain--;
        /* Set DAC user gain */
        XCVR_RX_DIG->AGC_CTRL_1 = XCVR_RX_DIG_AGC_CTRL_1_USER_LNA_GAIN_EN(1) |
                                  XCVR_RX_DIG_AGC_CTRL_1_LNA_USER_GAIN(0) | /* 2 */
                                  XCVR_RX_DIG_AGC_CTRL_1_USER_BBA_GAIN_EN(1) |
                                  XCVR_RX_DIG_AGC_CTRL_1_BBA_USER_GAIN(bba_gain) ; /* 10 */
        kw41zrf_xcvr_spin(TsettleCal * 2);
        rx_dc_est_samples(&dc_meas_i, &dc_meas_q, RX_DC_EST_SAMPLES);
        DEBUG("rx i=%d q=%d\n", (int)dc_meas_i, (int)dc_meas_q);
        dc_meas_i /= RX_DC_EST_SAMPLES;
        dc_meas_q /= RX_DC_EST_SAMPLES;
        DEBUG("rx i=%d q=%d\n", (int)dc_meas_i, (int)dc_meas_q);
        DEBUG("[kw41zrf] bba_gain=%u, meas I=%" PRId32 ", Q=%" PRId32 "\n", (unsigned)bba_gain, dc_meas_i, dc_meas_q);
    } while ((ABS(dc_meas_i) > 1900) || (ABS(dc_meas_q) > 1900));

    for (i = 0; i < 0x0F; i++)
    {
        DEBUG("rx i=%d q=%d\n", (int)dc_meas_i, (int)dc_meas_q);
        /* I channel :  */
        if (!TZA_I_OK) {
            if ((i > 0) && (!SAME_SIGN(dc_meas_i, dc_meas_i_p))) {
                if (ABS(dc_meas_i) > ABS(dc_meas_i_p)) {
                    curr_tza_dac_i = p_tza_dac_i;
                }

                TZA_I_OK = 1;
            }
            else {
                p_tza_dac_i = curr_tza_dac_i;

                if (dc_meas_i > 0) {
                    curr_tza_dac_i--;
                }
                else {
                    curr_tza_dac_i++;
                }
            }
        }
        else if (!BBA_I_OK) {
            /* Sweep BBA I */
            if ((curr_bba_dac_i != 0x20) && (!SAME_SIGN(dc_meas_i, dc_meas_i_p))) {
                if (ABS(dc_meas_i) > ABS(dc_meas_i_p)) {
                    curr_bba_dac_i = p_bba_dac_i;
                }

                BBA_I_OK = 1;
            }
            else {
                p_bba_dac_i = curr_bba_dac_i;
                if (dc_meas_i > 0) {
                    curr_bba_dac_i--;
                }
                else {
                    curr_bba_dac_i++;
                }
            }
        }

        /* Q channel : */
        if (!TZA_Q_OK) {
            if ((i > 0) && (!SAME_SIGN(dc_meas_q, dc_meas_q_p))) {
                if (ABS(dc_meas_q) > ABS(dc_meas_q_p)) {
                    curr_tza_dac_q = p_tza_dac_q;
                }
                TZA_Q_OK = 1;
            }
            else {
                p_tza_dac_q = curr_tza_dac_q;
                if (dc_meas_q > 0) {
                    curr_tza_dac_q--;
                }
                else {
                    curr_tza_dac_q++;
                }
            }
        }
        else if (!BBA_Q_OK) {
            /* Sweep BBA Q */
            if ((curr_bba_dac_q != 0x20) && (!SAME_SIGN(dc_meas_q, dc_meas_q_p))) {
                if (ABS(dc_meas_q) > ABS(dc_meas_q_p)) {
                    curr_bba_dac_q = p_bba_dac_q;
                }
                BBA_Q_OK = 1;
            }
            else {
                p_bba_dac_q = curr_bba_dac_q;
                if (dc_meas_q > 0) {
                    curr_bba_dac_q--;
                }
                else {
                    curr_bba_dac_q++;
                }
            }
        }

        /* DC OK break : */
        if (TZA_I_OK && TZA_Q_OK && BBA_I_OK && BBA_Q_OK) {
            break;
        }

