RIOT-OS/RIOT/drivers/kw41zrf/kw41zrf_xcvr.c
        dc_meas_i_p = dc_meas_i; /* Store as previous value */
        dc_meas_q_p = dc_meas_q; /* Store as previous value */
        DEBUG("curr_bba_dac i=%d q=%d\n", (int)curr_bba_dac_i, (int)curr_bba_dac_q);
        DEBUG("curr_tza_dac i=%d q=%d\n", (int)curr_tza_dac_i, (int)curr_tza_dac_q);
        XCVR_RX_DIG->DCOC_DAC_INIT = XCVR_RX_DIG_DCOC_DAC_INIT_BBA_DCOC_INIT_I(curr_bba_dac_i) |
                                     XCVR_RX_DIG_DCOC_DAC_INIT_BBA_DCOC_INIT_Q(curr_bba_dac_q) |
                                     XCVR_RX_DIG_DCOC_DAC_INIT_TZA_DCOC_INIT_I(curr_tza_dac_i) |
                                     XCVR_RX_DIG_DCOC_DAC_INIT_TZA_DCOC_INIT_Q(curr_tza_dac_q);
        kw41zrf_xcvr_spin(TsettleCal * 2);
        rx_dc_est_samples(&dc_meas_i, &dc_meas_q, RX_DC_EST_SAMPLES);
        dc_meas_i /= RX_DC_EST_SAMPLES;
        dc_meas_q /= RX_DC_EST_SAMPLES;
    }

    /* Apply optimized DCOC DAC INIT : */
    XCVR_RX_DIG->DCOC_DAC_INIT = XCVR_RX_DIG_DCOC_DAC_INIT_BBA_DCOC_INIT_I(curr_bba_dac_i) |
                                 XCVR_RX_DIG_DCOC_DAC_INIT_BBA_DCOC_INIT_Q(curr_bba_dac_q) |
                                 XCVR_RX_DIG_DCOC_DAC_INIT_TZA_DCOC_INIT_I(curr_tza_dac_i) |
                                 XCVR_RX_DIG_DCOC_DAC_INIT_TZA_DCOC_INIT_Q(curr_tza_dac_q);

    /* Restore register */
    XCVR_RX_DIG->DCOC_CTRL_0 = dcoc_ctrl_0_stack; /* Restore DCOC_CTRL_0 state to prior settings */
    XCVR_RX_DIG->DCOC_CTRL_1 = dcoc_ctrl_1_stack; /* Restore DCOC_CTRL_1 state to prior settings */
    XCVR_RX_DIG->RX_DIG_CTRL = rx_dig_ctrl_stack; /* Restore RX_DIG_CTRL state to prior settings */
    XCVR_RX_DIG->DCOC_CAL_GAIN = dcoc_cal_gain_state; /* Restore DCOC_CAL_GAIN state to prior setting */
    XCVR_RX_DIG->AGC_CTRL_1 = agc_ctrl_1_stack; /* Save state of RX_DIG_CTRL for later restore */
}

static int kw41zrf_xcvr_configure(kw41zrf_t *dev,
    const xcvr_common_config_t *com_config,
    const xcvr_mode_config_t *mode_config,
    const xcvr_mode_datarate_config_t *mode_datarate_config,
    const xcvr_datarate_config_t *datarate_config)
{
    (void)dev;
    int config_status = 0;
    uint32_t temp;

    /* Turn on the module clocks before doing anything */
    SIM->SCGC5 |= mode_config->scgc5_clock_ena_bits;

    /* XCVR_ANA configs */

    /* Configure PLL Loop Filter */
    XCVR_ANA->SY_CTRL_1 &= ~com_config->ana_sy_ctrl1.mask;
    XCVR_ANA->SY_CTRL_1 |= com_config->ana_sy_ctrl1.init;

    /* Configure VCO KVM */
    XCVR_ANA->SY_CTRL_2 &= ~mode_datarate_config->ana_sy_ctrl2.mask;
    XCVR_ANA->SY_CTRL_2 |= mode_datarate_config->ana_sy_ctrl2.init;

    /* Configure analog filter bandwidth */
    XCVR_ANA->RX_BBA &= ~mode_datarate_config->ana_rx_bba.mask;
    XCVR_ANA->RX_BBA |= mode_datarate_config->ana_rx_bba.init;
    XCVR_ANA->RX_TZA &= ~mode_datarate_config->ana_rx_tza.mask;
    XCVR_ANA->RX_TZA |= mode_datarate_config->ana_rx_tza.init;

    temp = XCVR_ANA->TX_DAC_PA;
    temp &= ~XCVR_ANALOG_TX_DAC_PA_TX_PA_BUMP_VBIAS_MASK;
    temp |= XCVR_ANALOG_TX_DAC_PA_TX_PA_BUMP_VBIAS(4);
    XCVR_ANA->TX_DAC_PA = temp;

    temp = XCVR_ANA->BB_LDO_2;
    temp &= ~XCVR_ANALOG_BB_LDO_2_BB_LDO_VCOLO_TRIM_MASK;
    temp |= XCVR_ANALOG_BB_LDO_2_BB_LDO_VCOLO_TRIM(0);
    XCVR_ANA->BB_LDO_2 = temp;

    temp = XCVR_ANA->RX_LNA;
    temp &= ~XCVR_ANALOG_RX_LNA_RX_LNA_BUMP_MASK;
    temp |= XCVR_ANALOG_RX_LNA_RX_LNA_BUMP(1);
    XCVR_ANA->RX_LNA = temp;

    temp = XCVR_ANA->BB_LDO_1;
    temp &= ~XCVR_ANALOG_BB_LDO_1_BB_LDO_FDBK_TRIM_MASK;
    temp |= XCVR_ANALOG_BB_LDO_1_BB_LDO_FDBK_TRIM(1);
    XCVR_ANA->BB_LDO_1 = temp;

    /* XCVR_MISC configs */
    temp = XCVR_MISC->XCVR_CTRL;
    temp &= ~(mode_config->xcvr_ctrl.mask | XCVR_CTRL_XCVR_CTRL_REF_CLK_FREQ_MASK);
    temp |= mode_config->xcvr_ctrl.init;
    if (CLOCK_RADIOXTAL == 26000000ul) {
        temp |= XCVR_CTRL_XCVR_CTRL_REF_CLK_FREQ(1);
    }

    XCVR_MISC->XCVR_CTRL = temp;

    /* XCVR_PHY configs */
    XCVR_PHY->PHY_PRE_REF0 = mode_config->phy_pre_ref0_init;
    XCVR_PHY->PRE_REF1 = mode_config->phy_pre_ref1_init;
    XCVR_PHY->PRE_REF2 = mode_config->phy_pre_ref2_init;
    XCVR_PHY->CFG1 = mode_config->phy_cfg1_init;
    XCVR_PHY->CFG2 = mode_datarate_config->phy_cfg2_init;
    XCVR_PHY->EL_CFG = mode_config->phy_el_cfg_init | datarate_config->phy_el_cfg_init; /* EL_WIN_SIZE and EL_INTERVAL are datarate dependent, */

    /* XCVR_PLL_DIG configs */
    XCVR_PLL_DIG->HPM_BUMP = com_config->pll_hpm_bump;
    XCVR_PLL_DIG->MOD_CTRL = com_config->pll_mod_ctrl;
    XCVR_PLL_DIG->CHAN_MAP = com_config->pll_chan_map;
    XCVR_PLL_DIG->LOCK_DETECT = com_config->pll_lock_detect;
    XCVR_PLL_DIG->HPM_CTRL = com_config->pll_hpm_ctrl;
    XCVR_PLL_DIG->HPMCAL_CTRL = com_config->pll_hpmcal_ctrl;
    XCVR_PLL_DIG->HPM_SDM_RES = com_config->pll_hpm_sdm_res;
    XCVR_PLL_DIG->LPM_CTRL = com_config->pll_lpm_ctrl;
    XCVR_PLL_DIG->LPM_SDM_CTRL1 = com_config->pll_lpm_sdm_ctrl1;
    XCVR_PLL_DIG->DELAY_MATCH = com_config->pll_delay_match;
    XCVR_PLL_DIG->CTUNE_CTRL = com_config->pll_ctune_ctrl;

    /* XCVR_RX_DIG configs */

    /* Configure RF Aux PLL for proper operation based on external clock frequency */
    temp = XCVR_ANA->RX_AUXPLL;
    temp &= ~XCVR_ANALOG_RX_AUXPLL_VCO_DAC_REF_ADJUST_MASK;
    if (CLOCK_RADIOXTAL == 26000000ul) {
        temp |= XCVR_ANALOG_RX_AUXPLL_VCO_DAC_REF_ADJUST(4);
    }
    else {
        temp |= XCVR_ANALOG_RX_AUXPLL_VCO_DAC_REF_ADJUST(7);
    }
    XCVR_ANA->RX_AUXPLL = temp;

    /* Configure RX_DIG_CTRL */
    if (CLOCK_RADIOXTAL == 26000000ul) {
        temp = com_config->rx_dig_ctrl_init | /* Common portion of RX_DIG_CTRL init */
               mode_config->rx_dig_ctrl_init_26mhz | /* Mode  specific portion of RX_DIG_CTRL init */
               datarate_config->rx_dig_ctrl_init_26mhz | /* Datarate specific portion of RX_DIG_CTRL init */
               XCVR_RX_DIG_RX_DIG_CTRL_RX_SRC_EN_MASK; /* Always enable the sample rate converter for 26MHz */
    }
    else {
        temp = com_config->rx_dig_ctrl_init | /* Common portion of RX_DIG_CTRL init */
               mode_config->rx_dig_ctrl_init_32mhz | /* Mode specific portion of RX_DIG_CTRL init */
               datarate_config->rx_dig_ctrl_init_32mhz | /* Datarate specific portion of RX_DIG_CTRL init */
               0; /* Always disable the sample rate converter for 32MHz */
    }

