RIOT-OS/RIOT/drivers/kw41zrf/kw41zrf_xcvr.c
    XCVR_RX_DIG->RX_RCCAL_CTRL0 = mode_datarate_config->rx_rccal_ctrl_0;
    XCVR_RX_DIG->RX_RCCAL_CTRL1 = mode_datarate_config->rx_rccal_ctrl_1;

    /* XCVR_TSM configs */
    XCVR_TSM->CTRL = com_config->tsm_ctrl;

    if ((mode_config->radio_mode != ZIGBEE_MODE) && (mode_config->radio_mode != BLE_MODE))
    {
        XCVR_TSM->CTRL &= ~XCVR_TSM_CTRL_DATA_PADDING_EN_MASK;
    }

    XCVR_MISC->LPPS_CTRL = com_config->lpps_ctrl_init; /* Register is in XCVR_MISC but grouped with TSM for initialization */

    XCVR_TSM->OVRD2 = com_config->tsm_ovrd2_init;
    /* TSM registers and timings - dependent upon clock frequency */
    if (CLOCK_RADIOXTAL == 26000000ul) {
        XCVR_TSM->END_OF_SEQ = com_config->end_of_seq_init_26mhz;
        XCVR_TSM->FAST_CTRL2 = com_config->tsm_fast_ctrl2_init_26mhz;
        XCVR_TSM->RECYCLE_COUNT = com_config->recycle_count_init_26mhz;
        XCVR_TSM->TIMING14 = com_config->tsm_timing_14_init_26mhz;
        XCVR_TSM->TIMING16 = com_config->tsm_timing_16_init_26mhz;
        XCVR_TSM->TIMING25 = com_config->tsm_timing_25_init_26mhz;
        XCVR_TSM->TIMING27 = com_config->tsm_timing_27_init_26mhz;
        XCVR_TSM->TIMING28 = com_config->tsm_timing_28_init_26mhz;
        XCVR_TSM->TIMING29 = com_config->tsm_timing_29_init_26mhz;
        XCVR_TSM->TIMING30 = com_config->tsm_timing_30_init_26mhz;
        XCVR_TSM->TIMING31 = com_config->tsm_timing_31_init_26mhz;
        XCVR_TSM->TIMING32 = com_config->tsm_timing_32_init_26mhz;
        XCVR_TSM->TIMING33 = com_config->tsm_timing_33_init_26mhz;
        XCVR_TSM->TIMING36 = com_config->tsm_timing_36_init_26mhz;
        XCVR_TSM->TIMING37 = com_config->tsm_timing_37_init_26mhz;
        XCVR_TSM->TIMING39 = com_config->tsm_timing_39_init_26mhz;
        XCVR_TSM->TIMING40 = com_config->tsm_timing_40_init_26mhz;
        XCVR_TSM->TIMING41 = com_config->tsm_timing_41_init_26mhz;
        XCVR_TSM->TIMING52 = com_config->tsm_timing_52_init_26mhz;
        XCVR_TSM->TIMING54 = com_config->tsm_timing_54_init_26mhz;
        XCVR_TSM->TIMING55 = com_config->tsm_timing_55_init_26mhz;
        XCVR_TSM->TIMING56 = com_config->tsm_timing_56_init_26mhz;
    }
    else {
        XCVR_TSM->END_OF_SEQ = com_config->end_of_seq_init_32mhz;
        XCVR_TSM->FAST_CTRL2 = com_config->tsm_fast_ctrl2_init_32mhz;
        XCVR_TSM->RECYCLE_COUNT = com_config->recycle_count_init_32mhz;
        XCVR_TSM->TIMING14 = com_config->tsm_timing_14_init_32mhz;
        XCVR_TSM->TIMING16 = com_config->tsm_timing_16_init_32mhz;
        XCVR_TSM->TIMING25 = com_config->tsm_timing_25_init_32mhz;
        XCVR_TSM->TIMING27 = com_config->tsm_timing_27_init_32mhz;
        XCVR_TSM->TIMING28 = com_config->tsm_timing_28_init_32mhz;
        XCVR_TSM->TIMING29 = com_config->tsm_timing_29_init_32mhz;
        XCVR_TSM->TIMING30 = com_config->tsm_timing_30_init_32mhz;
        XCVR_TSM->TIMING31 = com_config->tsm_timing_31_init_32mhz;
        XCVR_TSM->TIMING32 = com_config->tsm_timing_32_init_32mhz;
        XCVR_TSM->TIMING33 = com_config->tsm_timing_33_init_32mhz;
        XCVR_TSM->TIMING36 = com_config->tsm_timing_36_init_32mhz;
        XCVR_TSM->TIMING37 = com_config->tsm_timing_37_init_32mhz;
        XCVR_TSM->TIMING39 = com_config->tsm_timing_39_init_32mhz;
        XCVR_TSM->TIMING40 = com_config->tsm_timing_40_init_32mhz;
        XCVR_TSM->TIMING41 = com_config->tsm_timing_41_init_32mhz;
        XCVR_TSM->TIMING52 = com_config->tsm_timing_52_init_32mhz;
        XCVR_TSM->TIMING54 = com_config->tsm_timing_54_init_32mhz;
        XCVR_TSM->TIMING55 = com_config->tsm_timing_55_init_32mhz;
        XCVR_TSM->TIMING56 = com_config->tsm_timing_56_init_32mhz;
    }

    /* TSM timings independent of clock frequency */
    XCVR_TSM->TIMING00 = com_config->tsm_timing_00_init;
    XCVR_TSM->TIMING01 = com_config->tsm_timing_01_init;
    XCVR_TSM->TIMING02 = com_config->tsm_timing_02_init;
    XCVR_TSM->TIMING03 = com_config->tsm_timing_03_init;
    XCVR_TSM->TIMING04 = com_config->tsm_timing_04_init;
    XCVR_TSM->TIMING05 = com_config->tsm_timing_05_init;
    XCVR_TSM->TIMING06 = com_config->tsm_timing_06_init;
    XCVR_TSM->TIMING07 = com_config->tsm_timing_07_init;
    XCVR_TSM->TIMING08 = com_config->tsm_timing_08_init;
    XCVR_TSM->TIMING09 = com_config->tsm_timing_09_init;
    XCVR_TSM->TIMING10 = com_config->tsm_timing_10_init;
    XCVR_TSM->TIMING11 = com_config->tsm_timing_11_init;
    XCVR_TSM->TIMING12 = com_config->tsm_timing_12_init;
    XCVR_TSM->TIMING13 = com_config->tsm_timing_13_init;
    XCVR_TSM->TIMING15 = com_config->tsm_timing_15_init;
    XCVR_TSM->TIMING17 = com_config->tsm_timing_17_init;
    XCVR_TSM->TIMING18 = com_config->tsm_timing_18_init;
    XCVR_TSM->TIMING19 = com_config->tsm_timing_19_init;
    XCVR_TSM->TIMING20 = com_config->tsm_timing_20_init;
    XCVR_TSM->TIMING21 = com_config->tsm_timing_21_init;
    XCVR_TSM->TIMING22 = com_config->tsm_timing_22_init;
    XCVR_TSM->TIMING23 = com_config->tsm_timing_23_init;
    XCVR_TSM->TIMING24 = com_config->tsm_timing_24_init;
    XCVR_TSM->TIMING26 = com_config->tsm_timing_26_init;
    XCVR_TSM->TIMING34 = com_config->tsm_timing_34_init;
    XCVR_TSM->TIMING35 = com_config->tsm_timing_35_init;
    XCVR_TSM->TIMING38 = com_config->tsm_timing_38_init;
    XCVR_TSM->TIMING51 = com_config->tsm_timing_51_init;
    XCVR_TSM->TIMING53 = com_config->tsm_timing_53_init;
    XCVR_TSM->TIMING57 = com_config->tsm_timing_57_init;
    XCVR_TSM->TIMING58 = com_config->tsm_timing_58_init;

    if (CLOCK_RADIOXTAL == 26000000ul) {
        XCVR_TSM->END_OF_SEQ = XCVR_TSM_END_OF_SEQ_END_OF_TX_WU(END_OF_TX_WU) |
                               XCVR_TSM_END_OF_SEQ_END_OF_TX_WD(END_OF_TX_WD) |
                               XCVR_TSM_END_OF_SEQ_END_OF_RX_WU(END_OF_RX_WU_26MHZ) |
                               XCVR_TSM_END_OF_SEQ_END_OF_RX_WD(END_OF_RX_WD_26MHZ);
    }
    else {
        XCVR_TSM->END_OF_SEQ = XCVR_TSM_END_OF_SEQ_END_OF_TX_WU(END_OF_TX_WU) |
                               XCVR_TSM_END_OF_SEQ_END_OF_TX_WD(END_OF_TX_WD) |
                               XCVR_TSM_END_OF_SEQ_END_OF_RX_WU(END_OF_RX_WU) |
                               XCVR_TSM_END_OF_SEQ_END_OF_RX_WD(END_OF_RX_WD);
    }

    XCVR_TSM->PA_RAMP_TBL0 = com_config->pa_ramp_tbl_0_init;
    XCVR_TSM->PA_RAMP_TBL1 = com_config->pa_ramp_tbl_1_init;

    if ((mode_datarate_config->radio_mode == MSK) && ((mode_datarate_config->data_rate == DR_500KBPS) || (mode_datarate_config->data_rate == DR_250KBPS))) {
        /* Apply a specific value of TX_DIG_EN which assumes no DATA PADDING */
        XCVR_TSM->TIMING35 = com_config->tsm_timing_35_init | B0(TX_DIG_EN_ASSERT_MSK500); /* LSbyte is mode specific */
    }
    else {
        XCVR_TSM->TIMING35 = com_config->tsm_timing_35_init | mode_config->tsm_timing_35_init; /* LSbyte is mode specific, other bytes are common */
    }

    /* XCVR_TX_DIG configs */
    if (CLOCK_RADIOXTAL == 26000000ul) {
        XCVR_TX_DIG->FSK_SCALE = mode_datarate_config->tx_fsk_scale_26mhz; /* Applies only to 802.15.4 & MSK but won't harm other protocols */
        XCVR_TX_DIG->GFSK_COEFF1 = mode_config->tx_gfsk_coeff1_26mhz;
        XCVR_TX_DIG->GFSK_COEFF2 = mode_config->tx_gfsk_coeff2_26mhz;
    }
    else {
        XCVR_TX_DIG->FSK_SCALE = mode_datarate_config->tx_fsk_scale_32mhz; /* Applies only to 802.15.4 & MSK but won't harm other protocols */
        XCVR_TX_DIG->GFSK_COEFF1 = mode_config->tx_gfsk_coeff1_32mhz;
        XCVR_TX_DIG->GFSK_COEFF2 = mode_config->tx_gfsk_coeff2_32mhz;
    }

    XCVR_TX_DIG->CTRL = com_config->tx_ctrl;
    XCVR_TX_DIG->DATA_PADDING = com_config->tx_data_padding;
    XCVR_TX_DIG->DFT_PATTERN = com_config->tx_dft_pattern;

