RIOT-OS/RIOT/drivers/kw41zrf/kw41zrf_xcvr.c
    XCVR_TX_DIG->RF_DFT_BIST_1 = com_config->rf_dft_bist_1;
    XCVR_TX_DIG->RF_DFT_BIST_2 = com_config->rf_dft_bist_2;

    XCVR_TX_DIG->GFSK_CTRL = mode_config->tx_gfsk_ctrl;

    /* Force receiver warmup */
    bit_set32(&XCVR_TSM->CTRL, XCVR_TSM_CTRL_FORCE_RX_EN_SHIFT);
    /* Wait for TSM to reach the end of warmup (unless you want to capture some samples during DCOC cal phase) */
    uint32_t end_of_rx_wu = XCVR_CTRL_XCVR_STATUS_TSM_COUNT(
        (XCVR_TSM->END_OF_SEQ & XCVR_TSM_END_OF_SEQ_END_OF_RX_WU_MASK) >>
            XCVR_TSM_END_OF_SEQ_END_OF_RX_WU_SHIFT);
    while ((XCVR_MISC->XCVR_STATUS & XCVR_CTRL_XCVR_STATUS_TSM_COUNT_MASK) != end_of_rx_wu) {};

    int res = kw41zrf_rx_bba_dcoc_dac_trim_DCest();
    if (res < 0) {
        config_status = res;
    }
    //~ DCOC_DAC_INIT_Cal(0);
    kw41zrf_dcoc_dac_init_cal();
    /* Force receiver warmdown */
    bit_clear32(&XCVR_TSM->CTRL, XCVR_TSM_CTRL_FORCE_RX_EN_SHIFT);

    return config_status;
}

int kw41zrf_xcvr_init(kw41zrf_t *dev)
{
    (void) dev;
    uint8_t radio_id = ((RSIM->MISC & RSIM_MISC_RADIO_VERSION_MASK) >> RSIM_MISC_RADIO_VERSION_SHIFT);
    switch (radio_id) {
        case 0x3: /* KW41/31/21 v1 */
        case 0xb: /* KW41/31/21 v1.1 */
            break;
        default:
            return -ENODEV;
    }

    RSIM->RF_OSC_CTRL = (RSIM->RF_OSC_CTRL &
        ~(RSIM_RF_OSC_CTRL_RADIO_EXT_OSC_OVRD_MASK)) | /* Set EXT_OSC_OVRD value to zero */
        RSIM_RF_OSC_CTRL_RADIO_EXT_OSC_OVRD_EN_MASK; /* Enable over-ride with zero value */
    bit_set32(&SIM->SCGC5, SIM_SCGC5_PHYDIG_SHIFT); /* Enable PHY clock gate */

    /* Load IFR trim values */
    IFR_SW_TRIM_TBL_ENTRY_T sw_trim_tbl[] =
    {
        {TRIM_STATUS, 0, 0}, /* Fetch the trim status word if available. */
        {TRIM_VERSION, 0, 0} /* Fetch the trim version number if available. */
    };
    handle_ifr(&sw_trim_tbl[0], ARRAY_SIZE(sw_trim_tbl));
    DEBUG("[kw41zrf] sw_trim_tbl:\n");

    for (unsigned k = 0; k < ARRAY_SIZE(sw_trim_tbl); ++k) {
        DEBUG("[kw41zrf] [%u] id=0x%04x ", k, (unsigned)sw_trim_tbl[k].trim_id);
        if (sw_trim_tbl[k].trim_id == TRIM_STATUS) {
            DEBUG("(TRIM_STATUS)  ");
        }
        else if (sw_trim_tbl[k].trim_id == TRIM_VERSION) {
            DEBUG("(TRIM_VERSION) ");
        }
        DEBUG("value=%" PRIu32 ", valid=%u\n", sw_trim_tbl[k].trim_value,
            (unsigned)sw_trim_tbl[k].valid);
    }

    /* We only use 802.15.4 mode in this driver */
    xcvrStatus_t status = kw41zrf_xcvr_configure(dev, &xcvr_common_config,
        &zgbe_mode_config, &xcvr_ZIGBEE_500kbps_config, &xcvr_802_15_4_500kbps_config);

    if (status != gXcvrSuccess_c) {
        return -EIO;
    }
    return 0;
}
